templates_servicios/ambiente_prod/SOAP_MINEDUC_DispoLicenciaEnsenanzaMedia_input.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:aem="http://valida.aem.gob.cl" xmlns:xd="http://www.w3.org/2000/09/xmldsig#" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <aem:sobre>
         <aem:encabezado>
            <aem:idSobre>ELPISEE.inputParameter.headerParameters['id_sobre']</aem:idSobre>
            <aem:fechaHora>ELPISEE.inputParameter.headerParameters['fecha_hora']</aem:fechaHora>
            <aem:proveedor>
               <aem:nombre>ELPISEE.inputParameter.headerParameters['nombre_proveedor']</aem:nombre>
               <aem:servicios>
                  <aem:servicio>ELPISEE.inputParameter.headerParameters['nombre_servicio']</aem:servicio>
                  <aem:respuestaServicio>
                     <aem:estado>SI</aem:estado>
                     <aem:glosa>REST</aem:glosa>
                  </aem:respuestaServicio>
               </aem:servicios>
            </aem:proveedor>
            <aem:consumidor>
               <aem:nombre>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</aem:nombre>
               <aem:tramite>ELPISEE.inputParameter.headerParameters['nombre_tramite']</aem:tramite>
               <aem:certificado>
                  <xd:X509Data>
                     <xd:X509IssuerSerial>
                        <xd:X509IssuerName>IN</xd:X509IssuerName>
                        <xd:X509SerialNumber>0</xd:X509SerialNumber>
                     </xd:X509IssuerSerial>
                  </xd:X509Data>
               </aem:certificado>
            </aem:consumidor>
            <aem:fechaHoraReq>ELPISEE.inputParameter.headerParameters['fecha_hora']</aem:fechaHoraReq>
            <aem:emisor>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</aem:emisor>
            <aem:metadataOperacional>
               <aem:estadoSobre>00</aem:estadoSobre>
               <aem:glosaSobre>TRANSACCION EXITOSA</aem:glosaSobre>
            </aem:metadataOperacional>
         </aem:encabezado>
         <aem:cuerpo>
            <aem:documento>
               <aem:EntradaDisponibilidadLicencias>
                  <aem:Run>
                     <aem:numero>ELPISEE.inputParameter.bodyParameters['rut']</aem:numero>
                     <aem:dv>ELPISEE.inputParameter.bodyParameters['dv']</aem:dv>
                  </aem:Run>
               </aem:EntradaDisponibilidadLicencias>
            </aem:documento>
         </aem:cuerpo>
      </aem:sobre>
   </soapenv:Body>
</soapenv:Envelope>